#### ExternalResourceServerExtensions Members

---

|  |
| --- |
| ExternalResourceServerExtensions Class   Methods   Properties   See Also |

The  ExternalResourceServerExtensions  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  ExternalResourceServerExtensions |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetCADLinkOperations | Gets the specific methods supported by external resource CAD Links. |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetRevitLinkOperations | Gets the specific methods supported by the external resource of Revit Links. |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also

ExternalResourceServerExtensions Class

Autodesk.Revit.DB Namespace